base/Documents/бит_ЗакрытиеКонтрольныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ЗакрытиеКонтрольныхЗначений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыКонтроляПоБюджету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийКонтролируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_ЗакрытиеКонтрольныхЗначений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП 
	СовместимоУП = Истина;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИБ
	
#КонецОбласти

// Функция подготавливает параметры проведения.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_ЗакрытиеКонтрольныхЗначений.
//  Отказ - Булево.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Регистратор,
	|	КОНЕЦПЕРИОДА(Таблица.Дата, ДЕНЬ) КАК КонецПериода,
	|	Таблица.ВидКонтроля КАК ВидКонтроля,
	|	Таблица.ВидКонтроля КАК РежимКонтроля,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.СценарийКонтролируемый КАК СценарийКонтролируемый
	|ИЗ
	|	Документ.бит_ЗакрытиеКонтрольныхЗначений КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";

	Результат    	 = Запрос.Выполнить();
	ТаблицаРеквизиты = Результат.Выгрузить();
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	
	ПараметрыНастройки 		= Новый Структура;
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(ПараметрыНастройки, 
												Реквизиты.КонецПериода);

	Запрос.УстановитьПараметр("КонецПериода", 			 Реквизиты.КонецПериода);
	Запрос.УстановитьПараметр("Сценарий", 				 Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("СценарийКонтролируемый",  Реквизиты.СценарийКонтролируемый);
	Запрос.УстановитьПараметр("РежимКонтроля", 			 Реквизиты.РежимКонтроля);
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета", НеУчитыватьСверхБюджета);
	Запрос.УстановитьПараметр("СинонимСписка", 			 НСтр("ru = 'Контрольные значения'; en = 'Reference value'"));
	
	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаКонтрольныеЗначения(НомераТаблиц);
	
	Запрос.Текст = ТекстЗапроса;
	Результат 	 = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла; 	
	
	ПодготовитьКонтрольныеЗначенияБюджетов(ПараметрыПроведения);
			
	Возврат ПараметрыПроведения;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаКонтрольныеЗначения(НомераТаблиц)

	НомераТаблиц.Вставить("КонтрольныеЗначения", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтрольныеЗначения.Период КАК Период,
	|	КонтрольныеЗначения.РежимКонтроля КАК РежимКонтроля,
	|	КонтрольныеЗначения.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	КонтрольныеЗначения.Сценарий КАК Сценарий,
	|	КонтрольныеЗначения.ЦФО КАК ЦФО,
	|	КонтрольныеЗначения.СтатьяОборотов КАК СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &НеУчитыватьСверхБюджета
	|			ТОГДА КонтрольныеЗначения.СуммаСценарийКонтрольОборот - КонтрольныеЗначения.СуммаСценарийИсполнениеОборот
	|		ИНАЧЕ КонтрольныеЗначения.СуммаСценарийКонтрольОборот - КонтрольныеЗначения.СуммаСценарийИсполнениеОборот - КонтрольныеЗначения.СуммаСценарийСверхЛимитаОборот
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &НеУчитыватьСверхБюджета
	|			ТОГДА КонтрольныеЗначения.КоличествоСценарийКонтрольОборот - КонтрольныеЗначения.КоличествоСценарийИсполнениеОборот
	|		ИНАЧЕ КонтрольныеЗначения.КоличествоСценарийКонтрольОборот - КонтрольныеЗначения.КоличествоСценарийИсполнениеОборот - КонтрольныеЗначения.КоличествоСценарийИсполнениеОборот
	|	КОНЕЦ КАК Количество,
	|	""КонтрольныеЗначения"" КАК ИмяСписка,
	|	&СинонимСписка КАК СинонимСписка,
	|	1 КАК НомерСтроки,
	|	КонтрольныеЗначения.Аналитика_1 КАК Аналитика_1,
	|	КонтрольныеЗначения.Аналитика_2 КАК Аналитика_2,
	|	КонтрольныеЗначения.Аналитика_3 КАК Аналитика_3,
	|	КонтрольныеЗначения.Аналитика_4 КАК Аналитика_4,
	|	КонтрольныеЗначения.Аналитика_5 КАК Аналитика_5,
	|	КонтрольныеЗначения.Аналитика_6 КАК Аналитика_6,
	|	КонтрольныеЗначения.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП 
	|	КонтрольныеЗначения.Аналитика_8 КАК Аналитика_8,
	|	КонтрольныеЗначения.Аналитика_9 КАК Аналитика_9,
	|	КонтрольныеЗначения.Аналитика_10 КАК Аналитика_10,
	|	КонтрольныеЗначения.Аналитика_11 КАК Аналитика_11,
	|	КонтрольныеЗначения.Аналитика_12 КАК Аналитика_12
	// -- ЕРП 
	|ИЗ
	|	РегистрНакопления.бит_КонтрольныеЗначенияБюджетов.Обороты(
	|			,
	|			&КонецПериода,
	|			День,
	|			Сценарий = &Сценарий
	|				И СценарийКонтролируемый = &СценарийКонтролируемый
	|				И РежимКонтроля = &РежимКонтроля) КАК КонтрольныеЗначения";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Процедура ПодготовитьКонтрольныеЗначенияБюджетов(ПараметрыПроведения)
	
	КонтрольныеЗначения		   = бит_КонтрольИсполненияБюджета.ПустаяТаблицаКонтрольныеЗначения();
	ОстаткиКонтрольныхЗначений = ПараметрыПроведения.КонтрольныеЗначения;
	
	ПараметрыПроведения.КонтрольныеЗначения = КонтрольныеЗначения;
	
	Если НЕ ЗначениеЗаполнено(ОстаткиКонтрольныхЗначений) Тогда
		Возврат;
	КонецЕсли;
		
	НомерСтроки = 1;
	Для каждого СтрокаТаблицы Из ОстаткиКонтрольныхЗначений Цикл
		
		НоваяСтрока = КонтрольныеЗначения.Добавить();	
		Если СтрокаТаблицы.Сумма <= 0 И СтрокаТаблицы.Количество <= 0 Тогда
			Продолжить;		
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		// Только положительные значения.
		НоваяСтрока.СуммаСценарийИсполнение	     = Макс(СтрокаТаблицы.Сумма, 0);
		НоваяСтрока.КоличествоСценарийИсполнение = Макс(СтрокаТаблицы.Количество, 0);
		НоваяСтрока.НомерСтроки 				 = НомерСтроки;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
